//
//  Feelings.swift
//  AxisOne
//
//  Created by Ruslan Shigapov on 04.09.2025.
//

enum Feelings: String, CaseIterable, Identifiable {
    
    case anger = "Гнев"
    case fear = "Страх"
    case sadness = "Грусть"
    case joy = "Радость"
    
    var emotions: [String] {
        switch self {
        case .anger: [
            "недовольство",
            "огорчение",
            "раздражение",
            "обида",
            "неприязнь",
            "негодование",
            "зависть",
            "ревность",
            "злость",
            "нервозность",
            "отвращение",
            "ярость"
        ]
        case .fear: [
            "сомнение",
            "неловкость",
            "подозрение",
            "смущение",
            "растерянность",
            "замешательство",
            "опасение",
            "уязвленность",
            "беспокойство",
            "тревога",
            "испуг",
            "ужас"
        ]
        case .sadness: [
            "безразличие",
            "скука",
            "отрешенность",
            "одиночество",
            "усталость",
            "жалость",
            "сожаление",
            "разочарование",
            "вина, стыд",
            "печаль",
            "уныние",
            "тоска"
        ]
        case .joy: [
            "облегчение",
            "довольство",
            "интерес",
            "любопытство",
            "уверенность",
            "вера",
            "удовлетворение",
            "веселье",
            "увлечение",
            "возбуждение",
            "восторг",
            "счастье",
            "удивление",
            "уважение",
            "спокойствие",
            "принятие",
            "доверие",
            "благодарность",
            "забота",
            "теплота",
            "очарованность",
            "восхищение",
            "гордость",
            "доброта"
        ]
        }
    }
    
    var id: Self { self }
}
